#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_api_gateway_resource.get_projects: Refreshing state... [id=tqiml1]
aws_api_gateway_method_response.get_method_response (deposed object 86485749): Refreshing state... [id=agmr-jdub5r46se-tqiml1-GET-200]
aws_api_gateway_method_response.get_method_response: Refreshing state... [id=agmr-jdub5r46se-23tvm9-GET-200]
aws_api_gateway_integration.get_integration: Refreshing state... [id=agi-jdub5r46se-23tvm9-GET]
aws_api_gateway_method.get_method (deposed object 20383bab): Refreshing state... [id=agm-jdub5r46se-tqiml1-GET]
aws_api_gateway_resource.get_about: Refreshing state... [id=23tvm9]
aws_api_gateway_method.get_method: Refreshing state... [id=agm-jdub5r46se-23tvm9-GET]
aws_api_gateway_integration.get_integration (deposed object f56883b0): Refreshing state... [id=agi-jdub5r46se-tqiml1-GET]
aws_api_gateway_integration_response.get_integration_response: Refreshing state... [id=agir-jdub5r46se-tqiml1-GET-200]
aws_acm_certificate.thomaskimble_certificate: Refreshing state... [id=arn:aws:acm:eu-west-1:287212251408:certificate/29037fba-829c-4870-9979-4b1574a8c6fd]
data.aws_secretsmanager_secret.secret: Reading...
aws_route53_zone.thomaskimble_zone: Refreshing state... [id=Z06242472H0DG7GFLG30T]
aws_api_gateway_rest_api.thomaskimble: Refreshing state... [id=jdub5r46se]
aws_api_gateway_deployment.api_deployment: Refreshing state... [id=2my7jd]
aws_api_gateway_stage.prod: Refreshing state... [id=ags-jdub5r46se-prod]
aws_route53_record.thomaskimble_github_pages_record: Refreshing state... [id=Z06242472H0DG7GFLG30T_legacy_CNAME]
aws_route53_record.thomaskimble_records["*.thomaskimble.com"]: Refreshing state... [id=Z06242472H0DG7GFLG30T__fbc2c044fdd8abcc48ea06273249c30c.thomaskimble.com._CNAME]
aws_route53_record.thomaskimble_records["thomaskimble.com"]: Refreshing state... [id=Z06242472H0DG7GFLG30T__fbc2c044fdd8abcc48ea06273249c30c.thomaskimble.com._CNAME]
aws_route53_record.thomaskimble_outlook_mx_record: Refreshing state... [id=Z06242472H0DG7GFLG30T__MX]
aws_route53_record.thomaskimble_outlook_autodiscover_record: Refreshing state... [id=Z06242472H0DG7GFLG30T_autodiscover_CNAME]
aws_route53_record.thomaskimble_txt_records: Refreshing state... [id=Z06242472H0DG7GFLG30T__TXT]
aws_route53_record.thomaskimble_email_secureserver_record: Refreshing state... [id=Z06242472H0DG7GFLG30T_email_CNAME]
data.aws_secretsmanager_secret.secret: Read complete after 0s [id=arn:aws:secretsmanager:eu-west-1:287212251408:secret:ThomasOliverKimble-github-aws-access-token-Smhr9D]
data.aws_secretsmanager_secret_version.current: Reading...
data.aws_secretsmanager_secret_version.current: Read complete after 0s [id=arn:aws:secretsmanager:eu-west-1:287212251408:secret:ThomasOliverKimble-github-aws-access-token-Smhr9D|AWSCURRENT]
aws_amplify_app.thomaskimble_frontend: Refreshing state... [id=d393xlsrttjy5b]
aws_acm_certificate_validation.thomaskimble_certificate_validation: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
aws_amplify_branch.main: Refreshing state... [id=d393xlsrttjy5b/main]
aws_amplify_branch.dev: Refreshing state... [id=d393xlsrttjy5b/dev]
aws_amplify_domain_association.thomaskimble: Refreshing state... [id=d393xlsrttjy5b/thomaskimble.com]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_api_gateway_rest_api.thomaskimble has been deleted
  - resource "aws_api_gateway_rest_api" "thomaskimble" {
      - id                           = "jdub5r46se" -> null
        name                         = "thomaskimble"
      - root_resource_id             = "xgj8bev4al" -> null
        tags                         = {}
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_api_gateway_stage.prod has been deleted
  - resource "aws_api_gateway_stage" "prod" {
        id                    = "ags-jdub5r46se-prod"
      - invoke_url            = "https://jdub5r46se.execute-api.eu-west-1.amazonaws.com/prod" -> null
        tags                  = {}
        # (9 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_api_gateway_deployment.api_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "api_deployment" {
      ~ created_date  = "2024-05-15T10:37:14Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:eu-west-1:287212251408:jdub5r46se/" -> (known after apply)
      ~ id            = "2my7jd" -> (known after apply)
      ~ invoke_url    = "https://jdub5r46se.execute-api.eu-west-1.amazonaws.com/" -> (known after apply)
      ~ rest_api_id   = "jdub5r46se" # forces replacement -> (known after apply) # forces replacement
      ~ triggers      = { # forces replacement
          - "redeployment" = "21970fd3dc343b7d80dc1fce8c3fe02cd0746c33"
        } -> (known after apply) # forces replacement
    }

  # aws_api_gateway_integration.about_page_content_integration will be created
  + resource "aws_api_gateway_integration" "about_page_content_integration" {
      + cache_namespace      = (known after apply)
      + connection_type      = "INTERNET"
      + http_method          = "GET"
      + id                   = (known after apply)
      + passthrough_behavior = "WHEN_NO_MATCH"
      + request_templates    = {
          + "application/json" = <<-EOT
                {
                        "statusCode": 200
                      }
            EOT
        }
      + resource_id          = (known after apply)
      + rest_api_id          = (known after apply)
      + timeout_milliseconds = 29000
      + type                 = "MOCK"
    }

  # aws_api_gateway_integration_response.about_page_content_integration_response will be created
  + resource "aws_api_gateway_integration_response" "about_page_content_integration_response" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + resource_id        = (known after apply)
      + response_templates = {
          + "application/json" = <<-EOT
                {
                          "title": "About Me",
                          "date": "2024-05-14T15:23:56Z",
                          "bodyClass": "page-about",
                          "sections": [
                              {
                                  "type": "text",
                                  "content": "My name is **Thomas Oliver Kimble**, an engineer with a rich blend of skills and interests, encompassing data science, robotics, cloud engineering, and a strong passion for both music and design."
                              },
                              {
                                  "type": "image",
                                  "src": "/images/about/me.jpg"
                              },
                              {
                                  "type": "header",
                                  "content": "Personal Life"
                              },
                              {
                                  "type": "text",
                                  "content": "Originally from England, I moved to Switzerland when I was three and later to France. My education was mainly in Switzerland, where I pursued engineering—a field that aligned perfectly with my passion for math, science, and design. This combination of interests led me to explore both the analytical and creative sides of my personality, particularly through music. From the age of seven, I was immersed in music, playing in bands and learning instruments like the guitar, drums, and piano."
                              }
                          ]
                      }
            EOT
        }
      + rest_api_id        = (known after apply)
      + status_code        = "200"
    }

  # aws_api_gateway_method.about_page_content_method will be created
  + resource "aws_api_gateway_method" "about_page_content_method" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # aws_api_gateway_method_response.about_page_content_method_response will be created
  + resource "aws_api_gateway_method_response" "about_page_content_method_response" {
      + http_method     = "GET"
      + id              = (known after apply)
      + resource_id     = (known after apply)
      + response_models = {
          + "application/json" = "Empty"
        }
      + rest_api_id     = (known after apply)
      + status_code     = "200"
    }

  # aws_api_gateway_resource.about_page_content will be created
  + resource "aws_api_gateway_resource" "about_page_content" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "AboutPageContent"
      + rest_api_id = (known after apply)
    }

  # aws_api_gateway_rest_api.thomaskimble will be created
  + resource "aws_api_gateway_rest_api" "thomaskimble" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = (known after apply)
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = (known after apply)
      + name                         = "thomaskimble"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)
      + tags_all                     = (known after apply)

      + endpoint_configuration {
          + types            = [
              + "REGIONAL",
            ]
          + vpc_endpoint_ids = (known after apply)
        }
    }

  # aws_api_gateway_stage.prod will be created
  + resource "aws_api_gateway_stage" "prod" {
      + arn           = (known after apply)
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + stage_name    = "prod"
      + tags_all      = (known after apply)
      + web_acl_arn   = (known after apply)
    }

Plan: 8 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ api_deployment_arn = "arn:aws:execute-api:eu-west-1:287212251408:jdub5r46se/" -> (known after apply)
  ~ api_endpoint       = "https://jdub5r46se.execute-api.eu-west-1.amazonaws.com/prod/GetAbout" -> (known after apply)
  ~ api_gateway_url    = "https://jdub5r46se.execute-api.eu-west-1.amazonaws.com/" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @ThomasOliverKimble, Action: `pull_request`*